import styles from "./WhyTorino.module.css";
import Image from "next/image";

function WhyTorino() {
  return (
    <section className={styles.container}>
      <div className={styles.imageBox}>
        <Image
          src="/image/main/1319.jpg"
          alt="تورینو"
          width={800} 
          height={500} 
          style={{ width: "100%", height: "auto" }} 
        />
      </div>
      <div className={styles.content}>
        <h2 className={styles.subtitle}>چرا تورینو؟</h2>

        <div className={styles.card}>
          <h3>تورینو: همراه مطمئن تور های زیارتی و تفریحی به مشهد مقدس</h3>
          <p>
            تورینو، با تمرکز ویژه بر ارائه خدمات سفر به مشهد، از سال ۱۳۹۳ فعالیت
            خود را آغاز کرده است. این سامانه با ارائه امکاناتی مانند رزرو آنلاین
            تورهای مشهد، انتخاب هتل‌ها و اقامتگاه‌های نزدیک حرم، و برنامه‌ریزی
            اردوهای زیارتی، تجربه‌ای آسان و مطمئن را برای زائران فراهم می‌کند.
          </p>
        </div>

        <div className={styles.card}>
          <h3>خدمات متنوع تورینو برای سفر به مشهد</h3>
          <p>
            تورینو با ارائه پکیج‌های کامل سفر به مشهد، شامل بلیط رفت و برگشت،
            اقامت در هتل‌های معتبر، ترانسفر فرودگاهی و گشت‌های شهری، تمامی
            نیازهای زائران را پوشش می‌دهد. همچنین، امکان رزرو اردوهای گروهی و
            برنامه‌ریزی سفرهای زیارتی برای مدارس، دانشگاه‌ها و سازمان‌ها نیز
            فراهم است.
          </p>
        </div>

        <div className={styles.card}>
          <h3>چرا تورینو انتخابی مناسب برای سفر به مشهد است؟</h3>
          <p>
            با تورینو، زائران می‌توانند با اطمینان خاطر سفر خود به مشهد را
            برنامه‌ریزی کنند. این سامانه با ارائه اطلاعات دقیق، پشتیبانی ۲۴
            ساعته، و تضمین بهترین قیمت‌ها، تجربه‌ای بی‌نظیر از سفر به مشهد را
            برای کاربران فراهم می‌سازد.
          </p>
        </div>
      </div>
    </section>
  );
}

export default WhyTorino;
